#задания №1:

pet_species = input("Введите вид питомца: ")
pet_age = input("Введите возраст питомца: ")
pet_name = input("Введите кличку питомца: ")

print(f'Это {pet_species} по кличке "{pet_name}". Возраст: {pet_age} года.')


#задания №2:


s1 = input("Введите первый этап развития человека: ")
s2 = input("Введите второй этап развития человека: ")
s3 = input("Введите третий этап развития человека: ")
s4 = input("Введите четвертый этап развития человека: ")
s5 = input("Введите пятый этап развития человека: ")

print(s1, s2, s3, s4, s5, sep='=>')

